tiborsimon/embedded-tdd-headers/pic/8bit/pic18f97j60_tdd.h
#define RDE                           522
#define PORTE_RE0                     523
#define WRE                           524
#define AD9                           525
#define PORTE_WR                      526
#define NOT_WR                        527
#define nWR                           528
#define PORTE_RE1                     529
#define PC2                           530
#define nCS                           531
#define NOT_CS                        532
#define CS                            533
#define CCP10                         534
#define PB2                           535
#define PORTE_RE2                     536
#define AD10                          537
#define PORTE_RE3                     538
#define CCP9E                         539
#define AD11                          540
#define PC3E                          541
#define PORTE_RE4                     542
#define PB3E                          543
#define AD12                          544
#define CCP8E                         545
#define PORTE_RE5                     546
#define CCP7E                         547
#define AD13                          548
#define PC1E                          549
#define CCP6E                         550
#define PORTE_RE6                     551
#define AD14                          552
#define PB1E                          553
#define PORTE_CCP2                    554
#define CCP2E                         555
#define PORTE_ECCP2                   556
#define PA2E                          557
#define PORTE_RE7                     558
#define AD15                          559
#define PORTF                         560
#define PORTF_RF0                     561
#define AN5                           562
#define PORTF_RF1                     563
#define C2OUTF                        564
#define AN6                           565
#define PORTF_RF2                     566
#define AN7                           567
#define C1OUTF                        568
#define PORTF_RF3                     569
#define AN8                           570
#define PORTF_RF4                     571
#define AN9                           572
#define PORTF_RF5                     573
#define CVREF                         574
#define AN10                          575
#define PORTF_RF6                     576
#define AN11                          577
#define PORTF_RF7                     578
#define SS1                           579
#define nSS1                          580
#define NOT_SS1                       581
#define nSS                           582
#define NOT_SS                        583
#define SS                            584
#define PORTG                         585
#define CCP3                          586
#define ECCP3                         587
#define PORTG_RG0                     588
#define C3OUTG                        589
#define TX2                           590
#define PORTG_RG1                     591
#define CK2                           592
#define RX2                           593
#define PORTG_RG2                     594
#define DT2                           595
#define CCP4                          596
#define PORTG_RG3                     597
#define CCP5                          598
#define PORTG_RG4                     599
#define PORTG_RJPU                    600
#define PORTG_RG5                     601
#define PORTG_RG6                     602
#define PORTG_RG7                     603
#define PORTH                         604
#define PORTH_RH0                     605
#define AD16                          606
#define PORTH_RH1                     607
#define AD17                          608
#define PORTH_RH2                     609
#define AD18                          610
#define PORTH_RH3                     611
#define AD19                          612
#define PORTH_RH4                     613
#define CCP9                          614
#define PC3                           615
#define AN12                          616
#define PORTH_RH5                     617
#define CCP8                          618
#define PB3                           619
#define AN13                          620
#define PORTH_RH6                     621
#define CCP7                          622
#define PC1                           623
#define AN14                          624
#define PORTH_RH7                     625
#define CCP6                          626
#define PB1                           627
#define AN15                          628
#define PORTJ                         629
#define ALE                           630
#define PORTJ_RJ0                     631
#define nOE                           632
#define NOT_OE                        633
#define OE                            634
#define PORTJ_RJ1                     635
#define NOT_WRL                       636
#define nWRL                          637
#define WRL                           638
#define PORTJ_RJ2                     639
#define NOT_WRH                       640
#define nWRH                          641
#define WRH                           642
#define PORTJ_RJ3                     643
#define BA0                           644
#define PORTJ_RJ4                     645
#define NOT_CE                        646
#define nCE                           647
#define CE                            648
#define PORTJ_RJ5                     649
#define LB                            650
#define nLB                           651
#define NOT_LB                        652
#define PORTJ_RJ6                     653
#define NOT_UB                        654
#define nUB                           655
#define PORTJ_RJ7                     656
#define UB                            657
#define LATA                          658
#define LATA0                         659
#define LA0                           660
#define LATA1                         661
#define LA1                           662
#define LATA2                         663
#define LA2                           664
#define LATA3                         665
#define LA3                           666
#define LATA4                         667
#define LA4                           668
#define LATA5                         669
#define LA5                           670
#define REPU                          671
#define LA6                           672
#define LATA7                         673
#define RDPU                          674
#define LA7                           675
#define LATB                          676
#define LB0                           677
#define LATB0                         678
#define LB1                           679
#define LATB1                         680
#define LB2                           681
#define LATB2                         682
#define LB3                           683
#define LATB3                         684
#define LB4                           685
#define LATB4                         686
#define LB5                           687
#define LATB5                         688
#define LB6                           689
#define LATB6                         690
#define LB7                           691
#define LATB7                         692
#define LATC                          693
#define LATC0                         694
#define LC0                           695
#define LATC1                         696
#define LC1                           697
#define LATC2                         698
#define LC2                           699
#define LATC3                         700
#define LC3                           701
#define LATC4                         702
#define LC4                           703
#define LATC5                         704
#define LC5                           705
#define LATC6                         706
#define LC6                           707
#define LATC7                         708
#define LC7                           709
#define LATD                          710
#define LATD0                         711
#define LD0                           712
#define LATD1                         713
#define LD1                           714
#define LATD2                         715
#define LD2                           716
#define LATD3                         717
#define LD3                           718
#define LATD4                         719
#define LD4                           720
#define LATD5                         721
#define LD5                           722
#define LATD6                         723
#define LD6                           724
#define LATD7                         725
#define LD7                           726
#define LATE                          727
#define LATE0                         728
#define LE0                           729
#define LATE1                         730
#define LE1                           731
#define LATE2                         732
#define LE2                           733
#define LATE3                         734
#define LE3                           735
#define LATE4                         736
#define LE4                           737
#define LATE5                         738
#define LE5                           739
#define LATE6                         740
#define LE6                           741
#define LATE7                         742
#define LE7                           743
#define LATF                          744
#define LATF0                         745
#define LF0                           746
#define LATF1                         747
#define LF1                           748
#define LF2                           749
#define LATF2                         750
#define LF3                           751
#define LATF3                         752
#define LF4                           753
#define LATF4                         754
#define LF5                           755
#define LATF5                         756
#define LF6                           757
#define LATF6                         758
#define LF7                           759
#define LATF7                         760
#define LATG                          761
#define LATG0                         762
#define LG0                           763
#define LATG1                         764
#define LG1                           765
#define LATG2                         766
#define LG2                           767
#define LATG3                         768
#define LG3                           769
#define LATG4                         770
#define LG4                           771
#define LATG5                         772
#define LATG6                         773
#define LATG7                         774
#define LATH                          775
#define LH0                           776
#define LATH0                         777
#define LH1                           778
#define LATH1                         779
#define LH2                           780
#define LATH2                         781
#define LH3                           782
#define LATH3                         783
#define LH4                           784
#define LATH4                         785
#define LH5                           786
#define LATH5                         787
#define LH6                           788
#define LATH6                         789
#define LH7                           790
#define LATH7                         791
#define LATJ                          792
#define LATJ0                         793
#define LJ0                           794
#define LATJ1                         795
#define LJ1                           796
#define LATJ2                         797
#define LJ2                           798
#define LATJ3                         799
#define LJ3                           800
#define LATJ4                         801
#define LJ4                           802
#define LATJ5                         803
#define LJ5                           804
#define LATJ6                         805
#define LJ6                           806
#define LATJ7                         807
#define LJ7                           808
#define TRISA                         809
#define TRISA_RA0                     810
#define TRISA0                        811
#define TRISA_RA1                     812
#define TRISA1                        813
#define TRISA2                        814
#define TRISA_RA2                     815
#define TRISA_RA3                     816
#define TRISA3                        817
#define TRISA_RA4                     818
#define TRISA4                        819
#define TRISA_RA5                     820
#define TRISA5                        821
#define TRISB                         822
#define TRISB_RB0                     823
#define TRISB0                        824
#define TRISB_RB1                     825
#define TRISB1                        826
#define TRISB_RB2                     827
#define TRISB2                        828
#define TRISB_RB3                     829
#define TRISB3                        830
#define TRISB_RB4                     831
#define TRISB4                        832
#define TRISB_RB5                     833
#define TRISB5                        834
#define TRISB_RB6                     835
#define TRISB6                        836
#define TRISB_RB7                     837
#define TRISB7                        838
#define TRISC                         839
#define TRISC0                        840
#define TRISC_RC0                     841
#define TRISC1                        842
#define TRISC_RC1                     843
#define TRISC2                        844
#define TRISC_RC2                     845
#define TRISC3                        846
#define TRISC_RC3                     847
#define TRISC4                        848
#define TRISC_RC4                     849
#define TRISC5                        850
#define TRISC_RC5                     851
#define TRISC6                        852
#define TRISC_RC6                     853
#define TRISC7                        854
#define TRISC_RC7                     855
#define TRISD                         856
#define TRISD_RD0                     857
#define TRISD0                        858
#define TRISD_RD1                     859
#define TRISD1                        860
#define TRISD_RD2                     861
#define TRISD2                        862
#define TRISD_RD3                     863
#define TRISD3                        864
#define TRISD_RD4                     865
#define TRISD4                        866
#define TRISD_RD5                     867
#define TRISD5                        868
#define TRISD_RD6                     869
#define TRISD6                        870
#define TRISD_RD7                     871
#define TRISD7                        872
#define TRISE                         873
#define TRISE_RE0                     874
#define TRISE0                        875
#define TRISE1                        876
#define TRISE_RE1                     877
#define TRISE2                        878
#define TRISE_RE2                     879
#define TRISE_RE3                     880
#define TRISE3                        881
#define TRISE_RE4                     882
#define TRISE4                        883
#define TRISE_RE5                     884
#define TRISE5                        885
#define TRISE_RE6                     886
#define TRISE6                        887
#define TRISE_RE7                     888
#define TRISE7                        889
#define TRISF                         890
#define TRISF0                        891
#define TRISF_RF0                     892
#define TRISF_RF1                     893
#define TRISF1                        894
#define TRISF_RF2                     895
#define TRISF2                        896
#define TRISF3                        897
#define TRISF_RF3                     898
#define TRISF_RF4                     899
#define TRISF4                        900
#define TRISF_RF5                     901
#define TRISF5                        902
#define TRISF_RF6                     903
#define TRISF6                        904
#define TRISF7                        905
#define TRISF_RF7                     906
#define TRISG                         907
#define TRISG_RG0                     908
#define TRISG0                        909
#define TRISG_RG1                     910
#define TRISG1                        911
#define TRISG_RG2                     912
#define TRISG2                        913
#define TRISG_RG3                     914
#define TRISG3                        915
#define TRISG4                        916
#define TRISG_RG4                     917
#define TRISG5                        918
#define TRISG_RG5                     919
#define TRISG6                        920
#define TRISG_RG6                     921
#define TRISG7                        922
#define TRISG_RG7                     923
#define TRISH                         924
#define TRISH_RH0                     925
#define TRISH0                        926
#define TRISH_RH1                     927
#define TRISH1                        928
#define TRISH_RH2                     929
#define TRISH2                        930
#define TRISH_RH3                     931
#define TRISH3                        932
#define TRISH_RH4                     933
#define TRISH4                        934
#define TRISH_RH5                     935
#define TRISH5                        936
#define TRISH_RH6                     937
#define TRISH6                        938
#define TRISH_RH7                     939
#define TRISH7                        940
#define TRISJ                         941
#define TRISJ_RJ0                     942
#define TRISJ0                        943
#define TRISJ_RJ1                     944
#define TRISJ1                        945
#define TRISJ_RJ2                     946
#define TRISJ2                        947
#define TRISJ_RJ3                     948
#define TRISJ3                        949
#define TRISJ_RJ4                     950
#define TRISJ4                        951
#define TRISJ_RJ5                     952
#define TRISJ5                        953
#define TRISJ_RJ6                     954
#define TRISJ6                        955
#define TRISJ_RJ7                     956
#define TRISJ7                        957
#define OSCTUNE                       958
#define TUN4                          959
#define PPRE                          960
#define TUN5                          961
#define PPST0                         962
#define PLLEN                         963
#define PPST1                         964
#define MEMCON                        965
#define WM                            966
#define WM0                           967
#define WM1                           968
#define WAIT0                         969
#define WAIT                          970
#define WAIT1                         971
#define EBDIS                         972
#define PIE1                          973
#define TMR1IE                        974
#define TMR2IE                        975
#define CCP1IE                        976
#define SSP1IE                        977
#define SSPIE                         978
#define PIE1_TXIE                     979
#define TX1IE                         980
#define RC1IE                         981
#define RCIE                          982
#define ADIE                          983
#define PSPIE                         984
#define PIR1                          985
#define TMR1IF                        986
#define TMR2IF                        987
#define CCP1IF                        988
#define SSPIF                         989
#define SSP1IF                        990
#define TX1IF                         991
#define PIR1_TXIF                     992
#define RCIF                          993
#define RC1IF                         994
#define ADIF                          995
#define PSPIF                         996
#define IPR1                          997
#define TMR1IP                        998
#define TMR2IP                        999
#define CCP1IP                        1000
#define SSPIP                         1001
#define SSP1IP                        1002
#define TX1IP                         1003
#define TXIP                          1004
#define RCIP                          1005
#define RC1IP                         1006
#define ADIP                          1007
#define PSPIP                         1008
#define PIE2                          1009
#define CCP2IE                        1010
#define TMR3IE                        1011
#define BCL1IE                        1012
#define BCLIE                         1013
#define ETHIE                         1014
#define CMIE                          1015
#define OSCFIE                        1016
#define PIR2                          1017
#define CCP2IF                        1018
#define TMR3IF                        1019
#define BCL1IF                        1020
#define BCLIF                         1021
#define ETHIF                         1022
#define CMIF                          1023
#define OSCFIF                        1024
#define IPR2                          1025
#define CCP2IP                        1026
#define TMR3IP                        1027
#define BCLIP                         1028
#define BCL1IP                        1029
#define ETHIP                         1030
#define CMIP                          1031
#define OSCFIP                        1032
#define PIE3                          1033
#define CCP3IE                        1034
#define RXB0IE                        1035
#define RXBNIE                        1036
#define RXB1IE                        1037
#define CCP4IE                        1038
#define TXB0IE                        1039
#define CCP5IE                        1040
#define TXB1IE                        1041
#define TMR4IE                        1042
#define TXB2IE                        1043
#define TXBNIE                        1044
#define TX2IE                         1045
#define RC2IE                         1046
#define BCL2IE                        1047
#define SSP2IE                        1048
#define PIR3                          1049
#define CCP3IF                        1050
#define RXBNIF                        1051
#define CCP4IF                        1052
#define CCP5IF                        1053
#define TMR4IF                        1054
#define TXBNIF                        1055
#define TX2IF                         1056
#define RC2IF                         1057
#define BCL2IF                        1058
#define SSP2IF                        1059
#define IPR3                          1060
#define CCP3IP                        1061
#define CCP4IP                        1062
#define RXBNIP                        1063
#define CCP5IP                        1064
#define TMR4IP                        1065
#define TX2IP                         1066
#define TXBNIP                        1067
#define RC2IP                         1068
#define BCL2IP                        1069
#define SSP2IP                        1070
#define EECON1                        1071
#define EECON1_WR                     1072
#define WREN                          1073
#define WRERR                         1074
#define FREE                          1075
#define RCSTA1                        1076
#define RCSTA1_RX9D                   1077
#define RX9D1                         1078
#define RCSTA1_RCD8                   1079
#define RCSTA1_OERR                   1080
#define OERR1                         1081
#define RCSTA1_FERR                   1082
#define FERR1                         1083
#define RCSTA1_ADDEN                  1084
#define ADDEN1                        1085
#define RCSTA1_CREN                   1086
#define CREN1                         1087
#define SRENA                         1088
#define SREN1                         1089
#define RCSTA1_SREN                   1090
